#include<iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "ukr");
	printf("Василiв Богдан, IС-01, завдання № 31\n");
	
	float a, b, c;// значення заданих дійсних чисел
	cout << "Введiть число a:"; cin >> a;// ввід числа а
	cout << "Введiть число b:"; cin >> b;// ввід числа b
	cout << "Введiть число c:"; cin >> c;// ввід числа с
	
	if ((a == b) || (a == c) || (b == c))// перевірка умови чи є пара рівних чисел
		cout <<"Iснує пара чисел рiвних мiж собою\n";// вивід результату при виконанні умови

	else// якщо умова не виконується
		cout << "Немає  рiвних мiж собою чисел\n";// вивід результату коли умова не виконується
	system("pause");
}