#include<iostream>
#include<cmath>
using namespace std;

int main()
{
    setlocale(LC_ALL, "UKR");
    printf("Василiв Богдан, IС-01, завдання №26\n");

    int n = 0;
    float x0,// значення х 
        x,// значення наступного х
        a,// введене число
        c,// різниця між х і х0
        eps = 0.0001;// точність обчислення 

    cout << "Введiть а:"; cin >> a;// ввід числа
    if (a == 0)// оскільки задана формула не працює для 0, виводимо х=0, що очевидно
        cout << "Наше значення x=0\n";
    else// якщо а не дорівнює 0
    {
        if (a <= 1)// умова 1
            x0 = min(2.0 * a, 0.95);// х0 при умові 1
        else if (1 < a && a < 25)// умова 2
            x0 = a / 5;// значення х0 при умові 2
        else x0 = a / 25;// значення х0 якшо не виконується умова 1 і умова 2

        do
        {
            x = 4. / 5 * x0 + a / (5 * pow(x0, 4));// розрахунок х за заданою формулою
            c = x - x0;// обчислення різниці попереднього х і поточного
            x0 = x;//присвоєння значенню х0 поточного значення х
            n++;
            cout << "x=" << x << endl;//вивід поточного х
        } while (fabs(c) >= eps);// умова за якої виконується обчислення для заданої точності
        cout << "Наше значення х=" << x << endl;// вивід х з потрібною нам точністю 
    }
        return 0;
    
}